; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 - counter
	)
  (:init
		(= (value c0) 7)
	(= (value c1) 90)
	(= (value c2) 29)
	(= (value c3) 4)
	(= (value c4) 76)
	(= (value c5) 6)
	(= (value c6) 28)
	(= (value c7) 0)
	(= (value c8) 78)
	(= (value c9) 74)
	(= (value c10) 88)
	(= (value c11) 90)
	(= (value c12) 80)
	(= (value c13) 55)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
		)
	)
)

; plan
1. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 6 of 13
2. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 6 of 13
3. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 6 of 13
4. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 6 of 13
5. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 6 of 13
6. (increment c13)
   changed: (value c13) from 55 to 59
   goals met: 6 of 13
7. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 6 of 13
8. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 6 of 13
9. (increment c12)
   changed: (value c12) from 80 to 83
   goals met: 6 of 13
10. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 6 of 13
11. (increment c12)
   changed: (value c12) from 83 to 87
   goals met: 6 of 13
12. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 6 of 13
13. (increment c12)
   changed: (value c12) from 87 to 91
   goals met: 7 of 13
14. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 7 of 13
15. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 7 of 13
16. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 7 of 13
17. (increment c9)
   changed: (value c9) from 74 to 77
   goals met: 7 of 13
18. (increment c9)
   changed: (value c9) from 77 to 80
   goals met: 8 of 13
19. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 8 of 13
20. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 8 of 13
21. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 8 of 13
22. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 8 of 13
23. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 8 of 13
24. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 8 of 13
25. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 8 of 13
26. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 8 of 13
27. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 8 of 13
28. (decrement_rate c2)
   changed: (rate_value c2) from 1 to 0
   goals met: 8 of 13
29. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 8 of 13
30. (decrement c1)
   changed: (value c1) from 90 to 84
   goals met: 8 of 13
31. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 8 of 13
32. (increment c13)
   changed: (value c13) from 59 to 65
   goals met: 8 of 13
33. (increment c13)
   changed: (value c13) from 65 to 71
   goals met: 8 of 13
34. (increment c13)
   changed: (value c13) from 71 to 77
   goals met: 8 of 13
35. (increment c13)
   changed: (value c13) from 77 to 83
   goals met: 8 of 13
36. (increment c13)
   changed: (value c13) from 83 to 89
   goals met: 8 of 13
37. (increment c13)
   changed: (value c13) from 89 to 95
   goals met: 9 of 13
38. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 9 of 13
39. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 9 of 13
40. (increment c3)
   changed: (value c3) from 4 to 9
   goals met: 9 of 13
41. (increment c3)
   changed: (value c3) from 9 to 14
   goals met: 9 of 13
42. (increment c3)
   changed: (value c3) from 14 to 19
   goals met: 9 of 13
43. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 9 of 13
44. (increment c3)
   changed: (value c3) from 19 to 25
   goals met: 9 of 13
45. (increment c3)
   changed: (value c3) from 25 to 31
   goals met: 10 of 13
46. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 10 of 13
47. (decrement c1)
   changed: (value c1) from 84 to 77
   goals met: 10 of 13
48. (decrement c1)
   changed: (value c1) from 77 to 70
   goals met: 10 of 13
49. (decrement c1)
   changed: (value c1) from 70 to 63
   goals met: 10 of 13
50. (decrement c1)
   changed: (value c1) from 63 to 56
   goals met: 10 of 13
51. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 10 of 13
52. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 10 of 13
53. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 10 of 13
54. (decrement c1)
   changed: (value c1) from 56 to 49
   goals met: 10 of 13
55. (decrement c1)
   changed: (value c1) from 49 to 42
   goals met: 10 of 13
56. (decrement c1)
   changed: (value c1) from 42 to 35
   goals met: 10 of 13
57. (decrement c1)
   changed: (value c1) from 35 to 28
   goals met: 11 of 13
58. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 11 of 13
59. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 11 of 13
60. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 11 of 13
61. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 11 of 13
62. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 11 of 13
63. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 11 of 13
64. (increment c7)
   changed: (value c7) from 0 to 6
   goals met: 11 of 13
65. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 11 of 13
66. (increment c7)
   changed: (value c7) from 6 to 13
   goals met: 11 of 13
67. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 11 of 13
68. (increment c7)
   changed: (value c7) from 13 to 21
   goals met: 11 of 13
69. (increment c7)
   changed: (value c7) from 21 to 29
   goals met: 12 of 13
70. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 12 of 13
71. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 12 of 13
72. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 12 of 13
73. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 12 of 13
74. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 12 of 13
75. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 12 of 13
76. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 12 of 13
77. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 12 of 13
78. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 12 of 13
79. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 12 of 13
80. (increment c5)
   changed: (value c5) from 6 to 16
   goals met: 12 of 13
81. (increment c5)
   changed: (value c5) from 16 to 26
   goals met: 12 of 13
82. (increment c5)
   changed: (value c5) from 26 to 36
   goals met: 11 of 13
83. (increment c5)
   changed: (value c5) from 36 to 46
   goals met: 11 of 13
84. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 11 of 13
85. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 11 of 13
86. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 11 of 13
87. (decrement c5)
   changed: (value c5) from 46 to 36
   goals met: 11 of 13
88. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 11 of 13
89. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 11 of 13
90. (decrement c4)
   changed: (value c4) from 76 to 71
   goals met: 11 of 13
91. (decrement c4)
   changed: (value c4) from 71 to 66
   goals met: 11 of 13
92. (decrement c5)
   changed: (value c5) from 36 to 26
   goals met: 12 of 13
93. (decrement c4)
   changed: (value c4) from 66 to 61
   goals met: 12 of 13
94. (decrement c4)
   changed: (value c4) from 61 to 56
   goals met: 12 of 13
95. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 12 of 13
96. (increment c5)
   changed: (value c5) from 26 to 36
   goals met: 11 of 13
97. (decrement c4)
   changed: (value c4) from 56 to 50
   goals met: 11 of 13
98. (decrement c5)
   changed: (value c5) from 36 to 26
   goals met: 12 of 13
99. (decrement c4)
   changed: (value c4) from 50 to 44
   goals met: 12 of 13
100. (decrement c4)
   changed: (value c4) from 44 to 38
   goals met: 12 of 13
101. (increment c5)
   changed: (value c5) from 26 to 36
   goals met: 11 of 13
102. (decrement c4)
   changed: (value c4) from 38 to 32
   goals met: 12 of 13
103. (decrement c5)
   changed: (value c5) from 36 to 26
   goals met: 12 of 13
104. (decrement c4)
   changed: (value c4) from 32 to 26
   goals met: 11 of 13
105. (decrement c4)
   changed: (value c4) from 26 to 20
   goals met: 12 of 13
106. (decrement c3)
   changed: (value c3) from 31 to 25
   goals met: 11 of 13
107. (decrement c3)
   changed: (value c3) from 25 to 19
   goals met: 12 of 13
108. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 12 of 13
109. (decrement c2)
   changed: (value c2) from 29 to 25
   goals met: 11 of 13
110. (decrement c2)
   changed: (value c2) from 25 to 21
   goals met: 11 of 13
111. (decrement c2)
   changed: (value c2) from 21 to 17
   goals met: 12 of 13
112. (decrement c1)
   changed: (value c1) from 28 to 21
   goals met: 12 of 13
113. (decrement c1)
   changed: (value c1) from 21 to 14
   goals met: 13 of 13
